package com.danilenko.helloworld.JavaRush.Lev3.nov04;

/*Все что нужно знать о Земле
        Перед тобой класс L04 - сборник переменных, описывающих определенные характеристики планеты Земля.
Сделай из переменных класса L04 глобальные константы. Не забудь переименовать переменные, чтобы они отвечали стилю написания глобальных переменных.
Требования:
Переменную name класса L04 нужно переделать в глобальную переменную.
Переменную square класса L04 нужно переделать в глобальную переменную.
Переменную population класса L04 нужно переделать в глобальную переменную.
Переменную equatorLength класса L04 нужно переделать в глобальную переменную.*/

public class L04 {

    public static final String NAME = "Земля";
    public static final double SQUARE = 510_100_000;
    public static final long POPULATION = 7_594_000_000L;
    public static final long EQUATOR_LENGTH = 40_075_696;
}