package com.danilenko.helloworld.JavaRush.Lev3.nov07;

/* Максимальное целое
Создай по одной переменной каждого примитивного целочисленного типа в классе Solution.
Этим переменным присвой максимально возможное для них значение.
Никаких методов создавать не нужно.
Требования:
В классе Solution должны быть созданы переменные всех примитивных целочисленных типов.
Всем целочисленным переменным должно быть присвоено максимально возможное для них значение.
В классе Solution не должно быть создано никаких методов.*/

public class L01 {

    byte a = 127;
    short b = 32767;
    int c = 2147483647;
    long d = 9223372036854775807L;
}
