package com.danilenko.helloworld.JavaRush.Lev3.nov08;

/* Экспонентная запись числа
Перед тобой 5 общеизвестных величин.
Перепиши их в более читаемый формат — экспоненциальный. Мантиcса должна представлять собой дробное число от 1.0 до 10.
После изменения формата чисел реальное значение, хранимое в переменной, не должно измениться.
Пример:
109.1678 — обычная форма;
1.091678E+2 — экспонентная форма записи.
Требования:
Существующим переменным должны присваиваться значения, записанные в экспонентном виде.
Значением мантисы должно быть дробное число от 1.0 до 10.
Реальное значение переменных не должно измениться.*/

public class L01 {

    double earthDiameter = 1.27420E+4;
    double lightSpeed = 2.997924580E+8;
    double uraniumAtomicMass = 2.380289E+2;
    double averageBeeWeight = 85E-3;
    double javaDeveloperSalary = 1.00000E+4;
}
